**Estadistica Aplicada**

Sesión 4   14 agosto 

David Eduardo Gómez Marín 1914352

In [6]:
#Lista
lista1 = ["Daimbler", "Pedro", "Maria"]

In [7]:
lista1.append("Jimena")

In [8]:
lista1

['Daimbler', 'Pedro', 'Maria', 'Jimena']

In [9]:
#Tuplas
tupla1= (23,45,"Libro")

In [10]:
type(tupla1)

tuple

La principal caracteristica de las TUPLAS es que es inmutable, es decir, NO se puede MODIFICAR

**DICCIONARIOS** (Mapeo de valores)

Un diccionario es un par de clave-valor

In [11]:
alumno_dic = {"Nombre":"Juan","Apellido":"Perez", "edad":21}

In [12]:
alumno_dic["Nombre"]

'Juan'

In [13]:
alumno_dic["edad"]

21

In [14]:
##Accedemos a las claves keys
alumno_dic.keys()

dict_keys(['Nombre', 'Apellido', 'edad'])

In [15]:
alumno_dic.values()

dict_values(['Juan', 'Perez', 21])

In [16]:
##Crear un diccionario de los alumnos del grupo
estadistica_g41 = {"Nombre":["Juan","Sebastian","Sorely"],"Edad":[19,19,18.5]}

In [17]:
estadistica_g41.keys()

dict_keys(['Nombre', 'Edad'])

In [18]:
estadistica_g41.values()

dict_values([['Juan', 'Sebastian', 'Sorely'], [19, 19, 18.5]])

## Pandas
Se utiliza para manipular datos estructurados. Pandas está construida sobre Numpy, es decir, cualquier función de Numpy, funciopna en Pandas.
En Pandas, hay 3 estructuras de datos:
 1. Series (unidimensionales)
 2. DataFrames (Datos en filas y columnas, bases de datos)
 3. Panel (Datos en filas y columnas, organizados a traces del tiempo)

**SERIES**

Supongamos que conocemos las edades de las siguientes personas: Juan 10, Pedro 20, Jorge 30, Ale 40, Alba 50

In [19]:
edades = [10,20,30,40,50]

In [20]:
edades

[10, 20, 30, 40, 50]

In [21]:
import pandas as pd

In [22]:
serie1 = pd.Series(edades, index =["Juan","Pedro","Jorge","Ale","Alba"])

In [23]:
serie1

Juan     10
Pedro    20
Jorge    30
Ale      40
Alba     50
dtype: int64

In [24]:
serie1.mean()

30.0

In [25]:
serie1.var()

250.0

In [26]:
serie1.std()

15.811388300841896

## Dataframes
Datos en filas y columnas

In [27]:
alumno1 = ["Juan", "Perez", 23]
alumno2 = ["Raul","Gonzalez",17]
alumno3 = ["Jimena","Rosas",20]
alumno4 = ["Alejandra","Saldaña",21]

In [28]:
clase_estadistica = [alumno1,alumno2,alumno3,alumno4]

In [29]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul', 'Gonzalez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'Saldaña', 21]]

In [30]:
df_clase = pd.DataFrame(clase_estadistica, columns=["Nombre","Apellido","Edad"])

In [31]:
type(df_clase)

pandas.core.frame.DataFrame

In [32]:
df_clase

      Nombre  Apellido  Edad
0       Juan     Perez    23
1       Raul  Gonzalez    17
2     Jimena     Rosas    20
3  Alejandra   Saldaña    21

Index son los nombres de las filas.
Columns son las columnas y vienen en negrito

In [33]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [35]:
df_clase["Estado"]= ["Nuevo Leon","Coahuila", "Nuevo Leon","Veracruz"]

In [36]:
df_clase

      Nombre  Apellido  Edad      Estado
0       Juan     Perez    23  Nuevo Leon
1       Raul  Gonzalez    17    Coahuila
2     Jimena     Rosas    20  Nuevo Leon
3  Alejandra   Saldaña    21    Veracruz

In [37]:
df_clase=df_clase.set_index("Nombre")

In [38]:
df_clase

           Apellido  Edad      Estado
Nombre
Juan          Perez    23  Nuevo Leon
Raul       Gonzalez    17    Coahuila
Jimena        Rosas    20  Nuevo Leon
Alejandra   Saldaña    21    Veracruz

In [39]:
df_clase["Edad en dias"] = df_clase["Edad"]*365

In [40]:
df_clase

           Apellido  Edad      Estado  Edad en dias
Nombre
Juan          Perez    23  Nuevo Leon          8395
Raul       Gonzalez    17    Coahuila          6205
Jimena        Rosas    20  Nuevo Leon          7300
Alejandra   Saldaña    21    Veracruz          7665

In [41]:
df_clase["Edad en meses"] = df_clase["Edad"]*12

In [42]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395            276
Raul       Gonzalez    17    Coahuila          6205            204
Jimena        Rosas    20  Nuevo Leon          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

## Selección de elementos en DataFrame
1. Selección estandar
2. Selección iloc
3. Selección loc
4. Selección con Bolaneos

In [43]:
df_clase

           Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan          Perez    23  Nuevo Leon          8395            276
Raul       Gonzalez    17    Coahuila          6205            204
Jimena        Rosas    20  Nuevo Leon          7300            240
Alejandra   Saldaña    21    Veracruz          7665            252

**Selección estandar**

In [44]:
#Selección estandar
df_clase["Apellido"]

Nombre
Juan            Perez
Raul         Gonzalez
Jimena          Rosas
Alejandra     Saldaña
Name: Apellido, dtype: object

*SELECCIONAR COLUMNAS*

In [45]:
df_clase[["Edad","Apellido"]]

           Edad  Apellido
Nombre
Juan         23     Perez
Raul         17  Gonzalez
Jimena       20     Rosas
Alejandra    21   Saldaña

LOS PRIMEROS CORCHETES SON PARA SELECCION Y LOS SEGUNDOS SON PARA INDICAR QUE ES UNA LISTA

*SELECCIONAR FILAS*

Se debe asignar un intervalo

In [46]:
df_clase[0:2]

        Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan       Perez    23  Nuevo Leon          8395            276
Raul    Gonzalez    17    Coahuila          6205            204

*ELEGIR COLUMNA EDAD, FILA 0,1*

In [47]:
df_clase[0:2]["Edad"]

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

**Selección i.loc ó Selección por posición**

In [48]:
df_clase.iloc[0:2,1]

Nombre
Juan    23
Raul    17
Name: Edad, dtype: int64

INDEX ES NOMBRE, APELLIDO 0, EDAD 1

Con dos puntos (:) se selecciona todo

In [49]:
df_clase.iloc[:,1]

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

**Selección por etiquetas ó Selección .loc**

dataframe.loc[filas, columnas]

In [50]:
df_clase.loc[:, "Edad"]

Nombre
Juan         23
Raul         17
Jimena       20
Alejandra    21
Name: Edad, dtype: int64

In [51]:
df_clase.loc["Juan","Edad"]

23

In [52]:
edad_juan = df_clase.loc["Juan","Edad"]

In [53]:
edad_juan

23

**Selección con Boleanos ó Selección con condición**

In [54]:
df_clase[df_clase["Edad"]>20]

          Apellido  Edad      Estado  Edad en dias  Edad en meses
Nombre
Juan         Perez    23  Nuevo Leon          8395            276
Alejandra  Saldaña    21    Veracruz          7665            252

In [55]:
df_clase["Edad"].mean()

20.25

In [56]:
df_clase["Edad"].std()

2.5

In [57]:
df_clase["Edad"].sum()

81

np.where(condicion,valor si se cumple, valor si no se cumple)

In [58]:
import numpy as np

In [97]:
df_clase["Mayor de edad"] = np.where(df_clase["Edad"]>18,"Mayor de edad", "Menor de edad")
#np.where es como un if de excel, se agregan 2 nuevas columnas donde si edades<18, son menores de edad, s no, son mayores de edad

In [98]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276,Mayor de edad,Egresados
Raul,Gonzalez,17,Coahuila,6205,204,Menor de edad,Prepa
Jimena,Rosas,20,Nuevo Leon,7300,240,Mayor de edad,Licenciatura
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [61]:
Condiciones =[ df_clase["Edad"]<=17,
              df_clase["Edad"]<23,
              df_clase["Edad"]>=23]
valor_condicion = ["Prepa","Licenciatura","Egresados"]
df_clase["Condición de estudio"]= np.select(Condiciones,valor_condicion,default="Invalido")

In [62]:
df_clase

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276,Mayor de edad,Egresados
Raul,Gonzalez,17,Coahuila,6205,204,Menor de edad,Prepa
Jimena,Rosas,20,Nuevo Leon,7300,240,Mayor de edad,Licenciatura
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [75]:
df_clase.count()

Apellido                4
Edad                    4
Estado                  4
Edad en dias            4
Edad en meses           4
Mayor de edad           4
Condición de estudio    4
dtype: int64

In [76]:
df_clase["Edad"].count()

4

In [65]:
df_clase.value_counts("Mayor de edad")

Mayor de edad
Mayor de edad    3
Menor de edad    1
dtype: int64

In [66]:
df_clase["Edad"].mean()

20.25

In [67]:
df_clase.groupby("Mayor de edad").mean()

C:\Users\DELL\AppData\Local\Temp\ipykernel_10792\568372151.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df_clase.groupby("Mayor de edad").mean()

                    Edad  Edad en dias  Edad en meses
Mayor de edad
Mayor de edad  21.333333   7786.666667          256.0
Menor de edad  17.000000   6205.000000          204.0

In [69]:
#aggregate agg
df_clase.agg(['count', 'mean'])

C:\Users\DELL\AppData\Local\Temp\ipykernel_10792\3480107350.py:2: FutureWarning: ['Apellido', 'Estado', 'Mayor de edad', 'Condición de estudio'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_clase.agg(['count', 'mean'])

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condición de estudio
count,4.0,4.00,4.0,4.00,4.0,4.0,4.0
mean,NaN,20.25,NaN,7391.25,243.0,NaN,NaN

In [77]:
## Query
df_clase.query('Edad>20')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Juan,Perez,23,Nuevo Leon,8395,276,Mayor de edad,Egresados
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [78]:
## Seleccionar a alejandra
df_clase.query('Nombre == "Alejandra"')

,Apellido,Edad,Estado,Edad en dias,Edad en meses,Mayor de edad,Condición de estudio
Nombre,,,,,,,
Alejandra,Saldaña,21,Veracruz,7665,252,Mayor de edad,Licenciatura

In [80]:
#Seleccionar a alejandra y a los que son mayores de edad
df_clase.query('Nombre == "Alejandra & Edad>20"')

Empty DataFrame
Columns: [Apellido, Edad, Estado, Edad en dias, Edad en meses, Mayor de edad, Condición de estudio]
Index: []

In [82]:
Calificaciones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [83]:
Calificaciones

    Id            Nombre   Apellido  Calficación Final
0    1           ANTONIO     GARCIA                 73
1    2            MANUEL  FERNANDEZ                 19
2    3              JOSE   GONZALEZ                 38
3    4             DAVID      PEREZ                 14
4    5              JUAN      LOPEZ                 99
5    6      JOSE ANTONIO  RODRIGUEZ                 66
6    7            JAVIER    SANCHEZ                 46
7    8         JOSE LUIS      GOMEZ                 89
8    9  FRANCISCO JAVIER    JIMENEZ                 10
9   10            CARLOS       RUIZ                 62
10  11             JESUS     ALONSO                 94
11  12         ALEJANDRO  HERNANDEZ                 17
12  13            MIGUEL       DIAZ                 85
13  14       JOSE MANUEL  GUTIERREZ                 34
14  15            RAFAEL    ALVAREZ                 86
15  16      MIGUEL ANGEL     MORENO                100
16  17             PEDRO      MUÑOZ                  1
17  18             PABLO     BLANCO                 64
18  19             ANGEL        GIL                100
19  20            SERGIO    AGUIRRE                  2
20  21        JOSE MARIA       DIEZ                 29
21  22          FERNANDO    SALAZAR                 51
22  23             JORGE      RAMOS                 76
23  24              LUIS  DOMINGUEZ                 12
24  25           ALBERTO      ORTIZ                 99
25  26       JUAN CARLOS     IBAÑEZ                 43
26  27            ALVARO    RAMIREZ                 40
27  28            ADRIAN       SAEZ                  7

In [84]:
Calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [85]:
Calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [86]:
Calificaciones.shape
#Nos da el numero de flas, columnas

(28, 4)

In [87]:
#De la sig manera imprimmos todo el dataframe
Calificaciones

    Id            Nombre   Apellido  Calficación Final
0    1           ANTONIO     GARCIA                 73
1    2            MANUEL  FERNANDEZ                 19
2    3              JOSE   GONZALEZ                 38
3    4             DAVID      PEREZ                 14
4    5              JUAN      LOPEZ                 99
5    6      JOSE ANTONIO  RODRIGUEZ                 66
6    7            JAVIER    SANCHEZ                 46
7    8         JOSE LUIS      GOMEZ                 89
8    9  FRANCISCO JAVIER    JIMENEZ                 10
9   10            CARLOS       RUIZ                 62
10  11             JESUS     ALONSO                 94
11  12         ALEJANDRO  HERNANDEZ                 17
12  13            MIGUEL       DIAZ                 85
13  14       JOSE MANUEL  GUTIERREZ                 34
14  15            RAFAEL    ALVAREZ                 86
15  16      MIGUEL ANGEL     MORENO                100
16  17             PEDRO      MUÑOZ                  1
17  18             PABLO     BLANCO                 64
18  19             ANGEL        GIL                100
19  20            SERGIO    AGUIRRE                  2
20  21        JOSE MARIA       DIEZ                 29
21  22          FERNANDO    SALAZAR                 51
22  23             JORGE      RAMOS                 76
23  24              LUIS  DOMINGUEZ                 12
24  25           ALBERTO      ORTIZ                 99
25  26       JUAN CARLOS     IBAÑEZ                 43
26  27            ALVARO    RAMIREZ                 40
27  28            ADRIAN       SAEZ                  7

In [88]:
#De la sig manera solo nos da las primeras observaciones
Calificaciones.head()

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [89]:
#tambien podemos pedir las primeras x observaciones
Calificaciones.head(10)

   Id            Nombre   Apellido  Calficación Final
0   1           ANTONIO     GARCIA                 73
1   2            MANUEL  FERNANDEZ                 19
2   3              JOSE   GONZALEZ                 38
3   4             DAVID      PEREZ                 14
4   5              JUAN      LOPEZ                 99
5   6      JOSE ANTONIO  RODRIGUEZ                 66
6   7            JAVIER    SANCHEZ                 46
7   8         JOSE LUIS      GOMEZ                 89
8   9  FRANCISCO JAVIER    JIMENEZ                 10
9  10            CARLOS       RUIZ                 62

In [90]:
#tambien podemos elegir las x ultimas observaciones
Calificaciones.tail()

    Id       Nombre   Apellido  Calficación Final
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [93]:
##vamos a elegir todas las columnas menos la de ID
Calificaciones = Calificaciones.loc[:,Calificaciones.columns!= 'Id']

In [94]:
Calificaciones

              Nombre   Apellido  Calficación Final
0            ANTONIO     GARCIA                 73
1             MANUEL  FERNANDEZ                 19
2               JOSE   GONZALEZ                 38
3              DAVID      PEREZ                 14
4               JUAN      LOPEZ                 99
5       JOSE ANTONIO  RODRIGUEZ                 66
6             JAVIER    SANCHEZ                 46
7          JOSE LUIS      GOMEZ                 89
8   FRANCISCO JAVIER    JIMENEZ                 10
9             CARLOS       RUIZ                 62
10             JESUS     ALONSO                 94
11         ALEJANDRO  HERNANDEZ                 17
12            MIGUEL       DIAZ                 85
13       JOSE MANUEL  GUTIERREZ                 34
14            RAFAEL    ALVAREZ                 86
15      MIGUEL ANGEL     MORENO                100
16             PEDRO      MUÑOZ                  1
17             PABLO     BLANCO                 64
18             ANGEL        GIL                100
19            SERGIO    AGUIRRE                  2
20        JOSE MARIA       DIEZ                 29
21          FERNANDO    SALAZAR                 51
22             JORGE      RAMOS                 76
23              LUIS  DOMINGUEZ                 12
24           ALBERTO      ORTIZ                 99
25       JUAN CARLOS     IBAÑEZ                 43
26            ALVARO    RAMIREZ                 40
27            ADRIAN       SAEZ                  7

In [95]:
#Renombrar 'Calficación final' pq ta mal escrita
Calificaciones = Calificaciones.rename(columns={'Calficación Final':'Calificación Final'})

In [96]:
Calificaciones

              Nombre   Apellido  Calificación Final
0            ANTONIO     GARCIA                  73
1             MANUEL  FERNANDEZ                  19
2               JOSE   GONZALEZ                  38
3              DAVID      PEREZ                  14
4               JUAN      LOPEZ                  99
5       JOSE ANTONIO  RODRIGUEZ                  66
6             JAVIER    SANCHEZ                  46
7          JOSE LUIS      GOMEZ                  89
8   FRANCISCO JAVIER    JIMENEZ                  10
9             CARLOS       RUIZ                  62
10             JESUS     ALONSO                  94
11         ALEJANDRO  HERNANDEZ                  17
12            MIGUEL       DIAZ                  85
13       JOSE MANUEL  GUTIERREZ                  34
14            RAFAEL    ALVAREZ                  86
15      MIGUEL ANGEL     MORENO                 100
16             PEDRO      MUÑOZ                   1
17             PABLO     BLANCO                  64
18             ANGEL        GIL                 100
19            SERGIO    AGUIRRE                   2
20        JOSE MARIA       DIEZ                  29
21          FERNANDO    SALAZAR                  51
22             JORGE      RAMOS                  76
23              LUIS  DOMINGUEZ                  12
24           ALBERTO      ORTIZ                  99
25       JUAN CARLOS     IBAÑEZ                  43
26            ALVARO    RAMIREZ                  40
27            ADRIAN       SAEZ                   7

In [101]:
Calificaciones['Situación'] = np.where(Calificaciones['Calificación Final']>=70, 'Aprobado', 'Reprobado')

In [102]:
Calificaciones

              Nombre   Apellido  Calificación Final  Situación
0            ANTONIO     GARCIA                  73   Aprobado
1             MANUEL  FERNANDEZ                  19  Reprobado
2               JOSE   GONZALEZ                  38  Reprobado
3              DAVID      PEREZ                  14  Reprobado
4               JUAN      LOPEZ                  99   Aprobado
5       JOSE ANTONIO  RODRIGUEZ                  66  Reprobado
6             JAVIER    SANCHEZ                  46  Reprobado
7          JOSE LUIS      GOMEZ                  89   Aprobado
8   FRANCISCO JAVIER    JIMENEZ                  10  Reprobado
9             CARLOS       RUIZ                  62  Reprobado
10             JESUS     ALONSO                  94   Aprobado
11         ALEJANDRO  HERNANDEZ                  17  Reprobado
12            MIGUEL       DIAZ                  85   Aprobado
13       JOSE MANUEL  GUTIERREZ                  34  Reprobado
14            RAFAEL    ALVAREZ                  86   Aprobado
15      MIGUEL ANGEL     MORENO                 100   Aprobado
16             PEDRO      MUÑOZ                   1  Reprobado
17             PABLO     BLANCO                  64  Reprobado
18             ANGEL        GIL                 100   Aprobado
19            SERGIO    AGUIRRE                   2  Reprobado
20        JOSE MARIA       DIEZ                  29  Reprobado
21          FERNANDO    SALAZAR                  51  Reprobado
22             JORGE      RAMOS                  76   Aprobado
23              LUIS  DOMINGUEZ                  12  Reprobado
24           ALBERTO      ORTIZ                  99   Aprobado
25       JUAN CARLOS     IBAÑEZ                  43  Reprobado
26            ALVARO    RAMIREZ                  40  Reprobado
27            ADRIAN       SAEZ                   7  Reprobado

In [103]:
Calificaciones['Calificación Final'].mean()

52.0

In [104]:
Calificaciones.groupby("Situación").mean()

C:\Users\DELL\AppData\Local\Temp\ipykernel_10792\1626016906.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Calificaciones.groupby("Situación").mean()

           Calificación Final
Situación
Aprobado            90.100000
Reprobado           30.833333

In [105]:
Calificaciones.groupby('Situación').mean().round(3)['Calificación Final']

C:\Users\DELL\AppData\Local\Temp\ipykernel_10792\755172065.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  Calificaciones.groupby('Situación').mean().round(3)['Calificación Final']

Situación
Aprobado     90.100
Reprobado    30.833
Name: Calificación Final, dtype: float64

In [106]:
Calificaciones.value_counts("Situación")

Situación
Reprobado    18
Aprobado     10
dtype: int64